{
    "data_elements": [
        {
            "page_name": "ObjectClass",
            "name": "Object Class",
            "source": "ISO",
            "definition": "Set of ideas, abstractions or things in the real world that are identified with explicit boundaries and meaning and whose properties and behaviour follow the same rules."
        },
        {
            "page_name": "Property",
            "name": "Property",
            "source": "ISO",
            "definition": "A property may be any feature that humans naturally use to distinguish one individual object from another. It is the human perception of a single quality of an object class in the real world."
        },
        {
            "page_name": "RepresentationClass",
            "name": "Representation Class Code",
            "source": "ISO",
            "definition": "The major intent of Representation class is to provide a discrete and complete set of high-level (coarse granularity) definitions for data element/value domain categorization. This is an aid to the user in terms of application of business rules.", 
            "enumeration": [
                {
                    "value_item": "Amount",
                    "value_definition": "Monetary value with units of currency."
                },
                {
                    "value_item": "Code",
                    "value_definition": "An enumerated list of all allowable values. Each enumerated value is a string that for brevity represents a specific meaning."
                },
                {
                    "value_item": "Count",
                    "value_definition": "Non-monetary numeric value arrived at by counting."
                },
                {
                    "value_item": "Date",
                    "value_definition": "An ISO 8601 date usually in the format CCYY-MM-DD."
                },
                {
                    "value_item": "DateTime",
                    "value_definition": "An ISO 8601 date (in the format CCYY-MM-DD) and time structure. Note: Do not use unless both the date and time are required fields. If one or the other is optional always specify the data elements as separate date and time elements."
                },
                {
                    "value_item": "Description",
                    "value_definition": "A text field used to describe or define something."
                },
                {
                    "value_item": "Graphic",
                    "value_definition": "Diagrams, graphs, mathematical curves, or the like, usually a vector image"
                },
                {
                    "value_item": "Icon",
                    "value_definition": "A sign or representation that stands for its object by virtue of a resemblance or analogy to it."
                },
                {
                    "value_item": "Identifier",
                    "value_definition": "A language-independent label, sign or token used to establish identity of, and uniquely distinguish one instance of an object within an identification scheme."
                },
                {
                    "value_item": "Indicator",
                    "value_definition": "Boolean, exactly two mutually exclusive values (true or false). A precise definition must be given for the meaning of a true value."
                },
                {
                    "value_item": "Measure",
                    "value_definition": "Numeric value determined by measurement with units. Typically used with items such as height or weight.  If the unit of measure is not clear it should be specified"
                },
                {
                    "value_item": "Name",
                    "value_definition": "A textual label used as identification of an object.  A name is usually meaningful in some language, and is the primary means of identification of objects for humans. Unlike an identifier, a name is not necessarily unique."
                },
                {
                    "value_item": "Number",
                    "value_definition": "Assigned or determined by calculation."
                },
                {
                    "value_item": "Percent",
                    "value_definition": "A type of Numeric that traditionally is the results of a ratio calculation that ranges from values of 0 to 1 for values of 0% to 100%."
                },
                {
                    "value_item": "Picture",
                    "value_definition": "A visual representation of a person, object, or scene, usually a raster image."
                },
                {
                    "value_item": "Quantity",
                    "value_definition": "A continuous number such as the linear dimensions, capacity/amount (non-monetary) of an object."
                },
                {
                    "value_item": "Rate",
                    "value_definition": "A type of numeric."
                },
                {
                    "value_item": "Text",
                    "value_definition": "Character string generally in the form of words."
                },
                {
                    "value_item": "Time",
                    "value_definition": "Time of day or duration, e.g. HH:MM:SS.SSSS."
                },
                {
                    "value_item": "Year",
                    "value_definition": "An ISO 8601 Year."
                }
            ]
    	},
    	{
    	    "page_name": "Definition",
    	    "name": "Defintion Text",
    	    "source": "ISO",
    	    "definition": "The definition text is a statement (commonly in a natural language) which specifies the meaning of the Designatable_Item. It may additionally record a source (7.3.2.4.2.3) for the text."
    	},
    	{
    	    "page_name": "DataTypeCode",
    	    "name": "Data Type Code",
    	    "source": "?",
    	    "enumeration": [
                {
                    "value_item": "Integer",
                    "value_definition": "The value space of integer is the infinite set {...,-2,-1,0,1,2,...}.  Essentially, the integer data type is used to specify a numeric value without a fractional component."
                },
                {
                    "value_item": "Character",
                    "value_definition": "Characters are classified for convenience as letters, digits, or other characters. A character is an atomic unit of text as specified by ISO/IEC 10646."
                },
                {
                    "value_item": "Boolean",
                    "value_definition": "Boolean has the value space required to support the mathematical concept of binary-valued logic: {true, false}."
                },
                {
                    "value_item": "Enumerated",
                    "value_definition": "The value space of a list datatype is a set of finite-length sequences of atomic values. The enumeration is a set of values from the value space."
                },
                {
                    "value_item": "Date-and-Time",
                    "value_definition": "The value space of Date-Time is closely related to the dates and times described in ISO 8601. Date-Time values may be viewed as objects with integer-valued year, month, day, hour and minute properties, a decimal-valued second property, and a boolean timezoned property"
                }
            ],
    	    "definition": "The format used for the collection of letters, digits, and/or symbols, to depict values of a data element, determined by the operations that may be performed on a data element."
    	},
    	{
    	    "page_name": "ValueItem",
    	    "name": "Value Item",
    	    "source": "ISO",
    	    "definition": "A permissible value for this domain."
    	},
    	{
    	    "page_name": "ValueDefinition",
    	    "name": "Value Definition",
    	    "source": "ISO",
    	    "definition": "The definition for this permissible value of the domain."
    	},
    	{
    		"page_name": "MinimumLengthNumber",
    		"name": "Minimum Length Number",
    		"source": "W3C",
    		"definition": "Minimum Length Number is the minimum number of units of length, where units of length varies depending on the type that is being derived from. The value of minLength must be a nonNegativeInteger."
    	},
    	{
    		"page_name": "MaximumLengthNumber",
    		"name": "Maximum Length Number",
    		"source": "W3C",
    		"definition": "Maximum Length Number maxLength is the maximum number of units of length, where units of length varies depending on the type that is being derived from. The value of maxLength must be a nonNegativeInteger."
    	},
    	{
    	    "page_name": "PatternText",
    	    "name": "Pattern Text",
    	    "source": "W3C",
    	    "definition": "Pattern is a constraint on the ·value space· of a datatype which is achieved by constraining the lexical space to literals which match a specific pattern. The value of pattern must be a regular expression."
        },
        {
            "page_name": "AdministrativeStatusCode",
            "name": "Administrative Status Code",
            "source": "ISO",
             "enumeration": [
                {
                    "value_item": "Incomplete",
                    "value_definition": "Initial submission to make community of interest aware of its existence."
                },
                {
                    "value_item": "Candidate",
                    "value_definition": "Being proposed for progression through registration levels.  Not all mandatory attributes are present."
                },
                {
                    "value_item": "Qualified",
                    "value_definition": "Quality and mandatory checks are complete.  Still requires formal cross-functional review."
                },
                {
                    "value_item": "Standard",
                    "value_definition": "Metadata item is approved for use"
                },
                {
                    "value_item": "Superseded",
                    "value_definition": "Metadata item is no longer recommended for use and a successor item is now preferred for use."
                },
                {
                    "value_item": "Retired",
                    "value_definition": "Metadata item is no longer recommended for use"
                },
                {
                    "value_item": "Application",
                    "value_definition": "Metadata item exists locally in an application system and is not specified at the logical level."
                },
                {
                    "value_item": "Historical",
                    "value_definition": "The metadata item is no longer in use."
                }
            ],
            "definition": "Designation of the status in the administrative life-cycle of a data element."
        },
        {
            "page_name": "CreationDate",
            "name": "Creation Date",
            "source": "ISO",
            "definition": "Date the element was created by the Data Steward."
        },
        {
            "page_name": "VersionIdentifier",
            "name": "Version Identifier",
            "source": "?",
            "definition": "The unique version identifier of a data element"
        },
        {
        	"page_name": "DataStewardName",
        	"name": "Data Steward Name",
        	"source": "?",
        	"definition": "A person delegated the responsibility for managing a data element."
        },
        {
            "page_name": "BusinessOwnerName",
            "name": "Business Owner Name",
            "source": "?",
            "definition": "The organization and contact within the organization that is responsible for the definition and other mandatory attributes by which the metadata item is specified."
        }
    ]
}
   