{
    "data_elements": [
        {
            "page_name": "Context",
            "name": "Context",
            "source": "ISO",
            "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Name",
            "definition": "A Context defines the setting within which the subject data has meaning. A Context may be a business domain, an information subject area, an information system, a database, file, data model, standard document, or any other environment determined by the stewardardship organization responsible for the Context, or the registration authority responsible for the registry." 
        },        
        {
            "page_name": "ObjectClass",
            "name": "Object Class",
            "source": "ISO",
            "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Name",
            "definition": "Set of ideas, abstractions or things in the real world that are identified with explicit boundaries and meaning and whose properties and behaviour follow the same rules."
        },
        {
            "page_name": "Property",
            "name": "Property",
            "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Name",
            "source": "ISO",
            "definition": "A property may be any feature that humans naturally use to distinguish one individual object from another. It is the human perception of a single quality of an object class in the real world."
        },
        {
            "page_name": "RepresentationClass",
            "name": "Representation Class Code",
            "source": "ISO",
            "data_type_code": "Enumerated",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Code",
            "definition": "The major intent of Representation class is to provide a discrete and complete set of high-level (coarse granularity) definitions for data element/value domain categorization. This is an aid to the user in terms of application of business rules.", 
            "enumeration": [
                {
                    "value_item": "Amount",
                    "value_definition": "Monetary value with units of currency."
                },
                {
                    "value_item": "Code",
                    "value_definition": "An enumerated list of all allowable values. Each enumerated value is a string that for brevity represents a specific meaning."
                },
                {
                    "value_item": "Count",
                    "value_definition": "Non-monetary numeric value arrived at by counting."
                },
                {
                    "value_item": "Date",
                    "value_definition": "An ISO 8601 date usually in the format CCYY-MM-DD."
                },
                {
                    "value_item": "DateTime",
                    "value_definition": "An ISO 8601 date (in the format CCYY-MM-DD) and time structure. Note: Do not use unless both the date and time are required fields. If one or the other is optional always specify the data elements as separate date and time elements."
                },
                {
                    "value_item": "Description",
                    "value_definition": "A text field used to describe or define something."
                },
                {
                    "value_item": "Graphic",
                    "value_definition": "Diagrams, graphs, mathematical curves, or the like, usually a vector image"
                },
                {
                    "value_item": "Icon",
                    "value_definition": "A sign or representation that stands for its object by virtue of a resemblance or analogy to it."
                },
                {
                    "value_item": "Identifier",
                    "value_definition": "A language-independent label, sign or token used to establish identity of, and uniquely distinguish one instance of an object within an identification scheme."
                },
                {
                    "value_item": "Indicator",
                    "value_definition": "Boolean, exactly two mutually exclusive values (true or false). A precise definition must be given for the meaning of a true value."
                },
                {
                    "value_item": "Measure",
                    "value_definition": "Numeric value determined by measurement with units. Typically used with items such as height or weight.  If the unit of measure is not clear it should be specified"
                },
                {
                    "value_item": "Name",
                    "value_definition": "A textual label used as identification of an object.  A name is usually meaningful in some language, and is the primary means of identification of objects for humans. Unlike an identifier, a name is not necessarily unique."
                },
                {
                    "value_item": "Number",
                    "value_definition": "Assigned or determined by calculation."
                },
                {
                    "value_item": "Percent",
                    "value_definition": "A type of Numeric that traditionally is the results of a ratio calculation that ranges from values of 0 to 1 for values of 0% to 100%."
                },
                {
                    "value_item": "Picture",
                    "value_definition": "A visual representation of a person, object, or scene, usually a raster image."
                },
                {
                    "value_item": "Quantity",
                    "value_definition": "A continuous number such as the linear dimensions, capacity/amount (non-monetary) of an object."
                },
                {
                    "value_item": "Rate",
                    "value_definition": "A type of numeric."
                },
                {
                    "value_item": "Text",
                    "value_definition": "Character string generally in the form of words."
                },
                {
                    "value_item": "Time",
                    "value_definition": "Time of day or duration, e.g. HH:MM:SS.SSSS."
                },
                {
                    "value_item": "Year",
                    "value_definition": "An ISO 8601 Year."
                }
            ]
    	},
    	{
    	    "page_name": "QualifierText",
    	    "name": "Qualifier Text",
    	    "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Text",
    	    "source": "ISO",
    	    "definition": "Qualifier terms may be attached to object class terms, property terms, and representation terms if necessary to distinguish one data element concept, conceptual domain, data element, or data value domain from another. These qualifier terms may be derived from structure sets specific to a context. In the rules for a naming convention, a restriction in the number of qualifier terms is recommended."
    	},
    	{
    	    "page_name": "Definition",
    	    "name": "Defintion Text",
    	    "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Text",
    	    "source": "ISO",
    	    "definition": "The definition text is a statement (commonly in a natural language) which specifies the meaning of the Designatable_Item. It may additionally record a source for the text."
    	},
    	{
    	    "page_name": "DataTypeCode",
    	    "name": "Data Type Code",
    	    "data_type_code": "Enumerated",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Code",
    	    "source": "?",
    	    "enumeration": [
                {
                    "value_item": "Integer",
                    "value_definition": "The value space of integer is the infinite set {...,-2,-1,0,1,2,...}.  Essentially, the integer data type is used to specify a numeric value without a fractional component."
                },
                {
                    "value_item": "Character",
                    "value_definition": "Characters are classified for convenience as letters, digits, or other characters. A character is an atomic unit of text as specified by ISO/IEC 10646."
                },
                {
                    "value_item": "Boolean",
                    "value_definition": "Boolean has the value space required to support the mathematical concept of binary-valued logic: {true, false}."
                },
                {
                    "value_item": "Enumerated",
                    "value_definition": "The value space of a list datatype is a set of finite-length sequences of atomic values. The enumeration is a set of values from the value space."
                },
                {
                    "value_item": "Natural Range",
                    "comment": "Note: Natural_Range is used as the type of both multiplicity (an attribute of Relation Roles) and arity (an attribute of Relations) in the Concepts metamodel region, but this in no way constrains how it may be used by a Registration Authority.",
                    "value_definition": "Natural_Range is a datatype comprising a range of “natural numbers“, i.e. the positive integers, including zero. Any instance of Natural_Range is one of: -a constant non-negative Integer -a bounded range of non-negative Integers defined by a minimum and a (strictly larger) maximum value -an unbounded range defined by only a non-negative minimum (e.g., 0..*, 1..*, 2..*)."
                },
                {
                    "value_item": "Sign",
                    "value_definition": "A sign may be a character string, graphic image, sound clip or other symbol that can be used to denote or designate a concept. The Sign datatype may be implemented using the Reflit(of_type) data structure (see ISO/IEC19773:2011 10.4.2), where the list of supported types is implementation defined. At a minimum, datatype String must be supported."
                },
                {
                    "value_item": "String",
                    "value_definition": "String is a family of datatypes which represent strings of symbols from standard character-sets. The syntax and semantics of the String datatype are as defined in ISO/IEC 11404:2007 10.1.5 Character String."
                },
                {
                    "value_item": "Text",
                    "comment": "Example: A business letter printed on paper or displayed on a screen.",
                    "value_definition": "Text is data in the form of characters, symbols, words, phrases, paragraphs, sentences, tables, or other character arrangements, intended to convey a meaning, and whose interpretation is essentially based upon the reader's knowledge of some natural language or artificial language [ISO/IEC 2382-23:1994]."
                },
                {
                    "value_item": "Value",
                    "value_definition": "A Value represents any instance of any datatype."
                },
                {
                    "value_item": "Date-and-Time",
                    "value_definition": "The value space of Date-Time is closely related to the dates and times described in ISO 8601. Date-Time values may be viewed as objects with integer-valued year, month, day, hour and minute properties, a decimal-valued second property, and a boolean timezoned property"
                }
            ],
    	    "definition": "The format used for the collection of letters, digits, and/or symbols, to depict values of a data element, determined by the operations that may be performed on a data element."
    	},
    	{
    	    "page_name": "Precision",
    	    "name": "Precision Number",
    	    "data_type_code": "Integer",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Number",
    	    "source": "ISO",
    	    "definition": "The number of decimal places permitted in any associated data element values"
    	},
    	{
    	    "page_name": "ClassificationScheme",
    	    "name": "Classification Scheme",
    	    "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Name",
    	    "source": "ISO",
    	    "definition": "Descriptive information for an arrangement or division of objects into groups based on criteria such as characteristics, which the objects have in common.  A classification scheme may be a taxonomy, a network, an ontology, or any other terminological system. The classification may also be just a list of controlled vocabulary of property words (or terms). The list might be taken from the 'leaf level' of a taxonomy."
    	},
    	    	{
    	    "page_name": "ValueDomain",
    	    "name": "Value Domain",
    	    "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Name",
    	    "source": "ISO",
    	    "comments": "An example of a conceptual domain and a set of value domains is ISO 3166, Codes for the representation of names of countries. For instance, ISO 3166 describes the set of seven value domains: short name in English, official name in English, short name in French, official name in French, alpha-2 code, alpha-3 code, and numeric code.  Additional examples of value domains are: Sex, which contains two designations (permissible values), M -> Male and F-> Female; Parent, which contains two designations (permissible values), M -> Mother and F -> Father.",
    	    "definition": "Value Domain is a class each instance of which models a value domain, a collection of permissible values. A value domain provides representation, but has no implication as to what data element concept the values are associated with, nor what the values mean. Permissible values are designations, bindings of signs (values) to their corresponding value meanings"
    	},
    	{
    	    "page_name": "ValueItem",
    	    "name": "Value Item",
    	    "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Name",
    	    "source": "ISO",
    	    "definition": "A permissible value for this domain."
    	},
    	{
    	    "page_name": "ValueDefinition",
    	    "name": "Value Definition",
    	    "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Text",
    	    "source": "ISO",
    	    "definition": "The definition for this permissible value of the domain."
    	},
    	{
    		"page_name": "MinimumLengthNumber",
    		"name": "Minimum Length Number",
    		"data_type_code": "Integer",
            "representation_class": "Numer",
            "min_length": 0,
            "max_length": 26,
    		"source": "W3C",
    		"definition": "Minimum Length Number is the minimum number of units of length, where units of length varies depending on the type that is being derived from. The value of minLength must be a nonNegativeInteger."
    	},
    	{
    		"page_name": "MaximumLengthNumber",
    		"name": "Maximum Length Number",
    		"data_type_code": "Integer",
            "representation_class": "Numer",
            "min_length": 0,
            "max_length": 16,
    		"source": "W3C",
    		"definition": "Maximum Length Number maxLength is the maximum number of units of length, where units of length varies depending on the type that is being derived from. The value of maxLength must be a nonNegativeInteger."
    	},
    	{
    	    "page_name": "PatternText",
    	    "name": "Pattern Text",
    	    "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Text",
    	    "source": "W3C",
    	    "definition": "Pattern is a constraint on the ·value space· of a datatype which is achieved by constraining the lexical space to literals which match a specific pattern. The value of pattern must be a regular expression."
        },
        {
            "page_name": "AdministrativeStatusCode",
            "name": "Administrative Status Code",
            "data_type_code": "Enumerated",
            "representation_class": "Text",
            "source": "ISO",
             "enumeration": [
                {
                    "value_item": "Incomplete",
                    "value_definition": "Initial submission to make community of interest aware of its existence."
                },
                {
                    "value_item": "Candidate",
                    "value_definition": "Being proposed for progression through registration levels.  Not all mandatory attributes are present."
                },
                {
                    "value_item": "Qualified",
                    "value_definition": "Quality and mandatory checks are complete.  Still requires formal cross-functional review."
                },
                {
                    "value_item": "Standard",
                    "value_definition": "Metadata item is approved for use"
                },
                {
                    "value_item": "Superseded",
                    "value_definition": "Metadata item is no longer recommended for use and a successor item is now preferred for use."
                },
                {
                    "value_item": "Retired",
                    "value_definition": "Metadata item is no longer recommended for use"
                },
                {
                    "value_item": "Application",
                    "value_definition": "Metadata item exists locally in an application system and is not specified at the logical level."
                },
                {
                    "value_item": "Historical",
                    "value_definition": "The metadata item is no longer in use."
                }
            ],
            "definition": "Designation of the status in the administrative life-cycle of a data element."
        },
        {
            "page_name": "CreationDate",
            "name": "Creation Date",
            "data_type_code": "Date",
            "min_length": 9,
            "max_length": 9,
            "representation_class": "Date",
            "source": "ISO",
            "definition": "Date the element was created by the Data Steward."
        },
        {
            "page_name": "EndDate",
            "name": "End Date",
            "data_type_code": "Date",
            "min_length": 9,
            "max_length": 9,
            "representation_class": "Date",
            "source": "ISO",
            "definition": "Date the element will be decommissioned by the Data Steward."
        },
        {
            "page_name": "VersionIdentifier",
            "name": "Version Identifier",
            "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Identifier",
            "source": "?",
            "definition": "The unique version identifier of a data element"
        },
        {
            "page_name": "Reference Document",
            "name": "Reference Document",
            "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Composite",
            "source": "ISO",
            "definition": "A Reference Document is a document that provides pertinent details for consultation about a subject."
        },
        {
        	"page_name": "DataStewardName",
        	"name": "Data Steward Name",
        	"data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Name",
        	"source": "?",
        	"definition": "A person delegated the responsibility for managing a data element."
        },
        {
        	"page_name": "DataElementExample",
        	"name": "Data Element Example",
        	"data_type_code": "Property",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Text",
        	"source": "ISO",
        	"definition": ""
        },
        {
            "page_name": "BusinessOwnerName",
            "name": "Business Owner Name",
            "data_type_code": "Character",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "Name",
            "source": "?",
            "definition": "The organization and contact within the organization that is responsible for the definition and other mandatory attributes by which the metadata item is specified."
        },
        {
            "page_name": "ObligationCode",
            "name": "ObligationCode",
            "data_type_code": "",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "",
            "source": "?",
            "definition": "?  Mandatory, Conditional, Optional"
        },
        {
            "page_name": "MultiplicityRage",
            "name": "Multiplicity Range",
            "data_type_code": "",
            "min_length": 0,
            "max_length": 255,
            "representation_class": "",
            "source": "?",
            "definition": ""
        }
    ]
}
   