{
    "data_elements": [
        {
            "page_name": "ObjectClass",
            "name": "Object Class",
            "source": "ISO",
            "definition": "Set of ideas, abstractions or things in the real world that are identified with explicit boundaries and meaning and whose properties and behaviour follow the same rules."
        },
        {
            "page_name": "Property",
            "name": "Property",
            "source": "ISO",
            "definition": "A property may be any feature that humans naturally use to distinguish one individual object from another. It is the human perception of a single quality of an object class in the real world."
        },
        {
            "page_name": "RepresentationClass",
            "name": "Representation Class",
            "source": "ISO",
            "definition": "The major intent of Representation class is to provide a discrete and complete set of high-level (coarse granularity) definitions for data element/value domain categorization. This is an aid to the user in terms of application of business rules." 
    	},
    	{
    	    "page_name": "Definition",
    	    "name": "Defintion Text",
    	    "source": "ISO",
    	    "definition": "The definition text is a statement (commonly in a natural language) which specifies the meaning of the Designatable_Item. It may additionally record a source (7.3.2.4.2.3) for the text."
    	},
    	{
    		"page_name": "MinimumLengthNumber",
    		"name": "Minimum Length Number",
    		"source": "W3C",
    		"definition": "Minimum Length Number is the minimum number of units of length, where units of length varies depending on the type that is being derived from. The value of minLength must be a nonNegativeInteger."
    	},
    	{
    		"page_name": "MaximumLengthNumber",
    		"name": "Maximum Length Number",
    		"source": "W3C",
    		"definition": "Maximum Length Number maxLength is the maximum number of units of length, where units of length varies depending on the type that is being derived from. The value of maxLength must be a nonNegativeInteger."
    	},
    	{
    	    "page_name": "PatternText",
    	    "name": "Pattern Text",
    	    "source": "W3C",
    	    "definition": "Pattern is a constraint on the ·value space· of a datatype which is achieved by constraining the lexical space to literals which match a specific pattern. The value of pattern must be a regular expression."
        }    	
    ]
}
   