{
    "data_elements": [
        {
            "page_name": "ObjectClass",
            "name": "Object Class",
            "source": "ISO",
            "definition": "Set of ideas, abstractions or things in the real world that are identified with explicit boundaries and meaning and whose properties and behaviour follow the same rules."
        },
        {
            "page_name": "Property",
            "name": "Property",
            "source": "ISO",
            "definition": "A property may be any feature that humans naturally use to distinguish one individual object from another. It is the human perception of a single quality of an object class in the real world."
        },
        {
            "page_name": "RepresentationClass",
            "name": "Representation Class Code",
            "source": "ISO",
            "definition": "The major intent of Representation class is to provide a discrete and complete set of high-level (coarse granularity) definitions for data element/value domain categorization. This is an aid to the user in terms of application of business rules.", 
            "enumeration": [
                {
                    "value_item": "Amount",
                    "value_definition": "Monetary value with units of currency."
                },
                {
                    "value_item": "Code",
                    "value_definition": "An enumerated list of all allowable values. Each enumerated value is a string that for brevity represents a specific meaning."
                }
            ]
    	},
    	{
    	    "page_name": "Definition",
    	    "name": "Defintion Text",
    	    "source": "ISO",
    	    "definition": "The definition text is a statement (commonly in a natural language) which specifies the meaning of the Designatable_Item. It may additionally record a source (7.3.2.4.2.3) for the text."
    	},
    	{
    	    "page_name": "DataTypeCode",
    	    "name": "Data Type Code",
    	    "source": "?",
    	    "definition": "The format used for the collection of letters, digits, and/or symbols, to depict values of a data element, determined by the operations that may be performed on a data element."
    	},
    	{
    		"page_name": "MinimumLengthNumber",
    		"name": "Minimum Length Number",
    		"source": "W3C",
    		"definition": "Minimum Length Number is the minimum number of units of length, where units of length varies depending on the type that is being derived from. The value of minLength must be a nonNegativeInteger."
    	},
    	{
    		"page_name": "MaximumLengthNumber",
    		"name": "Maximum Length Number",
    		"source": "W3C",
    		"definition": "Maximum Length Number maxLength is the maximum number of units of length, where units of length varies depending on the type that is being derived from. The value of maxLength must be a nonNegativeInteger."
    	},
    	{
    	    "page_name": "PatternText",
    	    "name": "Pattern Text",
    	    "source": "W3C",
    	    "definition": "Pattern is a constraint on the ·value space· of a datatype which is achieved by constraining the lexical space to literals which match a specific pattern. The value of pattern must be a regular expression."
        },
        {
            "page_name": "AdministrativeStatusCode",
            "name": "Administrative Status Code",
            "source": "ISO",
            "definition": "Designation of the status in the administrative life-cycle of a data element."
        },
        {
            "page_name": "CreationDate",
            "name": "Creation Date",
            "source": "ISO",
            "definition": "Date the element was created by the Data Steward."
        },
        {
            "page_name": "VersionIdentifier",
            "name": "Version Identifier",
            "source": "?",
            "definition": "The unique version identifier of a data element"
        },
        {
        	"page_name": "DataStewardName",
        	"name": "Data Steward Name",
        	"source": "?",
        	"definition": "A person delegated the responsibility for managing a data element."
        },
        {
            "page_name": "BusinessOwnerName",
            "name": "Business Owner Name",
            "source": "?",
            "definition": "The organization and contact within the organization that is responsible for the definition and other mandatory attributes by which the metadata item is specified."
        }
    ]
}
   